In [9]:
import pandas as pd
Student_Ad=pd.DataFrame({
        "Name":["Alex","Mark","Zack"],
    "Address":['My 4th Cross','5th Cross','6th Cross'],
},index=[0,1,2])
Student_Ad

   Name       Address
0  Alex  My 4th Cross
1  Mark     5th Cross
2  Zack     6th Cross

In [11]:
Student_ph=pd.DataFrame({
    "Name":["Alex","Mark","Zack"],
    "phoneNumber":[12345,8327635,9736753687]
}, index=[0,1,2])
Student_ph

   Name  phoneNumber
0  Alex        12345
1  Mark      8327635
2  Zack   9736753687

In [12]:
df3=pd.merge(Student_Ad,Student_ph,on="Name")
df3

   Name       Address  phoneNumber
0  Alex  My 4th Cross        12345
1  Mark     5th Cross      8327635
2  Zack     6th Cross   9736753687

In [18]:
Student_Ad=pd.DataFrame({
        "Name":["Alex","Mark","Zack","Josh"],
    "Address":['My 4th Cross','5th Cross','6th Cross','7th Cross'],
},index=[0,1,2,4])
Student_Ad

   Name       Address
0  Alex  My 4th Cross
1  Mark     5th Cross
2  Zack     6th Cross
4  Josh     7th Cross

In [14]:
df3=pd.merge(Student_Ad,Student_ph,on="Name")
df3

   Name       Address  phoneNumber
0  Alex  My 4th Cross        12345
1  Mark     5th Cross      8327635
2  Zack     6th Cross   9736753687

In [20]:
df3=pd.merge(Student_Ad,Student_ph,how="outer")
df3

   Name       Address   phoneNumber
0  Alex  My 4th Cross  1.234500e+04
1  Mark     5th Cross  8.327635e+06
2  Zack     6th Cross  9.736754e+09
3  Josh     7th Cross           NaN

In [19]:
df3=pd.merge(Student_Ad,Student_ph,how="left")
df3

   Name       Address   phoneNumber
0  Alex  My 4th Cross  1.234500e+04
1  Mark     5th Cross  8.327635e+06
2  Zack     6th Cross  9.736754e+09
3  Josh     7th Cross           NaN

In [17]:
df3=pd.merge(Student_Ad,Student_ph,how="right")
df3

   Name       Address  phoneNumber
0  Alex  My 4th Cross        12345
1  Mark     5th Cross      8327635
2  Zack     6th Cross   9736753687

In [28]:
def generateaAd():
      return pd.DataFrame({"Name":["Alex","Mark","Zack","Josh"],"Address":['My 4th Cross','5th Cross','6th Cross','7th Cross']},index=[0,1,2,4])

In [29]:
generateaAd()

   Name       Address
0  Alex  My 4th Cross
1  Mark     5th Cross
2  Zack     6th Cross
4  Josh     7th Cross

In [31]:
df3=pd.merge(generateaAd(),Student_ph,how="left",indicator=True)
df3

   Name       Address   phoneNumber     _merge
0  Alex  My 4th Cross  1.234500e+04       both
1  Mark     5th Cross  8.327635e+06       both
2  Zack     6th Cross  9.736754e+09       both
3  Josh     7th Cross           NaN  left_only